{
  "architectures": [
    "Ministral3ForCausalLM"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 1,
  "dtype": "bfloat16",
  "eos_token_id": 2,
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_size": 3072,
  "initializer_range": 0.02,
  "intermediate_size": 9216,
  "max_position_embeddings": 262144,
  "model_type": "ministral3",
  "num_attention_heads": 32,
  "num_hidden_layers": 26,
  "num_key_value_heads": 8,
  "pad_token_id": 11,
  "rms_norm_eps": 1e-05,
  "rope_parameters": {
    "beta_fast": 32.0,
    "beta_slow": 1.0,
    "factor": 16.0,
    "llama_4_scaling_beta": 0.1,
    "mscale": 1.0,
    "mscale_all_dim": 1.0,
    "original_max_position_embeddings": 16384,
    "rope_theta": 1000000.0,
    "rope_type": "yarn",
    "type": "yarn"
  },
  "sliding_window": null,
  "tie_word_embeddings": true,
  "transformers_version": "5.3.0",
  "use_cache": true,
  "vocab_size": 131072
}
